packages/windmapper/windmapper-2.1.8-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.8.data/data/share/windninja/ninjafoam/2.2.0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
$boundaryField$  
    minZ
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxZ
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
