packages/windmapper/windmapper-2.1.8-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.8.data/data/share/windninja/ninjafoam/2.2.0/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement

{
    boundary
    {
     
    maxZ
        {
            type            patch;
       }
    maxX
        {
            type            patch;
       }
    maxY
        {
            type            symmetryPlane;
       }
    NAME
        {
            type            wall;
       }
    minX
        {
            type            patch;
       }
    minY
        {
            type            symmetryPlane;
       }
    minZ
        {
            type            wall;
       }  
    }
}

// ************************************************************************* //